import {Hero} from "./interfaces";

export const ARTHUR: Hero = {
  title: 'Arthur',
  description: 'По преданиям, правитель королевства Логрес, легендарный вождь бриттов V—VI веков. Самый знаменитый из кельтских героев, центральный герой британского эпоса и многочисленных рыцарских романов. Согласно легендам, Артур стал королём во исполнение пророчества, защитил Британию от набегов саксов и собрал при своём дворе в Камелоте доблестнейших и благороднейших рыцарей Круглого стола, но в конце концов погиб в бою, защищая свой трон от узурпатора.',
  imageLink: 'https://i.redd.it/0dycuf973rq11.jpg'
}
export const DIABLO: Hero = {
  title: 'Diablo',
  description: 'Более известный как Диабло (англ. Diablo) является главным злодеем в Diablo, Diablo II и Diablo III. Является одним из Изначальных зол. У него есть два старших брата — Мефисто и Баал. Также его дочерью можно считать Лию. «К нашему несчастью, из всех Изначальных Зол мы больше всего знаем о Владыке Ужаса, Аль\'Диаболосе; чаще его именуют Диабло. Он суть корень всех страхов, глубоко сокрытых в смертных умах, кошмар, пробуждающий нас в холодном поту среди ночи. Он — воплощение чистой злобы и бездонного ужаса. Диабло несколько раз чумой прошёлся по Санктуарию, терзая смертных снова и снова, гораздо чаще, чем любой из его нечестивых собратьев.»',
  imageLink: 'https://media.wired.com/photos/615204854a9e495923621ef1/1:1/w_966,h_966,c_limit/Games-Diablo_LordOfTerror_2D_Desktop.jpg'
}
export const BANSHEE: Hero = {
  title: 'Banshee',
  description: 'Особая разновидность фей, предвещающих смерть. Обычно бродят крадучись среди деревьев, либо летают. Издают пронзительные вопли, в которых будто бы «сливаются крики диких гусей, рыдания ребёнка и волчий вой», предвещая смерть кого-либо из членов рода[2][3]. Оригинальный термин, ирл. bean sídhe, состоящий из bean — женщина, и sídhe — Ши, что вместе переводится как «женщина из сидов», из потустороннего мира[4]. Имя существа связано с традиционными древнеирландскими погребальными курганами или тумулусами, весьма распространёнными в ирландской сельской местности. Наряду с общепринятым обозначением, во многих районах острова для банши имеются и свои, локальные имена, причём в некоторых районах острова до сравнительно недавнего времени применялось только локальное название.',
  imageLink: 'https://i.pinimg.com/236x/50/d2/31/50d23164bf2ad993f8d1b7d9610f2d9e--beautiful-artwork-art-tattoos.jpg'
}
export const MELIODAS: Hero = {
  title: 'Meliodas',
  description: 'Капитан Семи Смертных Грехов, известный как "Грех Дракона - Гнев". Хозяин известного бара Шляпа Кабана и главный герой всего сюжета. Его священная реликвия — Демонический меч Лоствейн. Основная способность Мелиодаса — Полное отражение. Во время Арки Великого Бойцовского Фестиваля выясняется, что Мелиодас бывший лидер Десяти Заповедей.',
  imageLink: 'https://e0.pxfuel.com/wallpapers/953/925/desktop-wallpaper-the-seven-deadly-sins-meliodas-demon-form-anime-meliodas-demon-mode.jpg'
}
